{
    "image": "https://i.ibb.co/syWrfNK/Screen-Shot-2021-10-02-at-7-15-38-PM.png",
    "title": "Retro games on a MacBook Air M1",
    "date": "02-Oct-21",
    "type":"App Review",
    "data": [
        {
            "type": "text",
            "value": "If you are like me that love retro games and have a Mac, even the new M1 apple silicon Macs, you must check OpenEmu. Is an app for Mac that can emulate all the retro consoles from the old Atari to Sony Playstation, and also play the handheld consoles like GameBoy and PSP."
        },
        {
            "type": "image",
            "value": "https://i.ibb.co/8NS46NF/Screen-Shot-2021-10-02-at-7-05-27-PM.png"
        },
        {
            "type": "text",
            "value": "OpenEmu is so easy to use, just download the app from http://openemu.org, and run it and drop the Roms you have inside it. It automatically sort it by console and just double click on the game to run it. It pretty much remove all the need for any configuration or setup. As stated on their website you it has a 'It just works' philosophy."
        },
        {
            "type": "image",
            "value": "https://i.ibb.co/sgQd6df/Screen-Shot-2021-10-02-at-7-16-09-PM.png"
        },
        {
            "type": "text",
            "value": "You can hide consoles you don’t want to see just be careful to show it again when you want. I accidentally hid Nintendo 64 and when I tried to add rooms for that console it started shouting errors saying that console was not compatible, which I know it was not true. Going on edit and setting N64 to show solve the issue."
        }
        ,
        {
            "type": "image",
            "value": "https://i.ibb.co/YQ7sj40/Screen-Shot-2021-10-02-at-7-15-46-PM.png"
        },
        {
            "type": "text",
            "value": "Setting up controllers are very simple just bind each button on you controller to each button on the console controller. It does show a image of the original controller so is very easy to setup. It is a bit of hard working as you need to do the bindings for each console, and sometimes you mus think a bit to decide where to put each button. For example I’m using a Xbox One Bluetooth Controller so to bind to a Nintendo 64 is a bit weird, as most buttons have a weird position on the old console."
        },
        {
            "type": "image",
            "value": "https://i.ibb.co/syWrfNK/Screen-Shot-2021-10-02-at-7-15-38-PM.png"
        },
        {
            "type": "text",
            "value": "Performance wise the OpenEmu is very good specially if you are using one of the new M1 Macs, I’m currently using a MacBook Air without any issue even when running Playstation 1 games. I’m have a 2015 Macbook air with an I5 processor and it also can run, but I felt it a little bit sluggish on that machine when running heavy games like PS1 games."
        },
        {
            "type": "text",
            "value": "rAs a native Mac OS App with a such easy to use concept this is a must have for any Mac users specially if you love retro games."
        }
    ]
}
